; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v6 - type_3 ?v2 - type_2)
 	      (pred_2 ?v8 - object ?v2 - type_2)
	      (pred_1 ?v6 - type_3 ?v5 - type_1)
	      (pred_3 ?v6 - type_3 ?v8 - object ?v5 - type_1))

   (:action op_2
       :parameters  (?v6 - type_3 ?v3 ?v4 - type_2)
       :precondition (and  (pred_4 ?v6 ?v3))
       :effect (and  (pred_4 ?v6 ?v4)
		     (not (pred_4 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_3 ?v1 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v7) (pred_4 ?v6 ?v7) (pred_1 ?v6 ?v5))
       :effect (and (pred_3 ?v6 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v7)) 
		    (not (pred_1 ?v6 ?v5))))

   (:action op_3
       :parameters (?v6 - type_3 ?v1 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v1 ?v5) (pred_4 ?v6 ?v7))
       :effect (and (pred_2 ?v1 ?v7)
		    (pred_1 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v1 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_04 - type_3
obj_12 obj_08 obj_06 obj_11 - type_1
obj_01 obj_07 obj_02 - type_2
obj_05 obj_10 obj_09 - object)
(:init
(pred_4 obj_03 obj_07)
(pred_1 obj_03 obj_12)
(pred_1 obj_03 obj_08)
(pred_4 obj_04 obj_01)
(pred_1 obj_04 obj_06)
(pred_1 obj_04 obj_11)
(pred_2 obj_05 obj_01)
(pred_2 obj_10 obj_07)
(pred_2 obj_09 obj_01)
)
(:goal
(and
(pred_2 obj_05 obj_07)
(pred_2 obj_10 obj_07)
(pred_2 obj_09 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_03 obj_07) (pred_4 obj_04 obj_07))))
  )
)
)

; plan
1. (op_1 obj_04 obj_05 obj_01 obj_11)
   deleted: (pred_2 obj_05 obj_01) (pred_1 obj_04 obj_11)
   added: (pred_3 obj_04 obj_05 obj_11)
   goals met: 1 of 3
2. (op_1 obj_04 obj_09 obj_01 obj_06)
   deleted: (pred_2 obj_09 obj_01) (pred_1 obj_04 obj_06)
   added: (pred_3 obj_04 obj_09 obj_06)
   goals met: 1 of 3
3. (op_2 obj_03 obj_07 obj_01)
   deleted: (pred_4 obj_03 obj_07)
   added: (pred_4 obj_03 obj_01)
   goals met: 1 of 3
4. (op_2 obj_04 obj_01 obj_07)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_07)
   goals met: 1 of 3
5. (op_3 obj_04 obj_09 obj_07 obj_06)
   deleted: (pred_3 obj_04 obj_09 obj_06)
   added: (pred_2 obj_09 obj_07) (pred_1 obj_04 obj_06)
   goals met: 2 of 3
6. (op_3 obj_04 obj_05 obj_07 obj_11)
   deleted: (pred_3 obj_04 obj_05 obj_11)
   added: (pred_2 obj_05 obj_07) (pred_1 obj_04 obj_11)
   goals met: 3 of 3
